# GeometryWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InterferenceFailures..::..GeometryWarning Property
BuiltInFailures..::..InterferenceFailures Class See Also
---
A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GeometryWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GeometryWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GeometryWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InterferenceFailures Class
Autodesk.Revit.DB Namespace